#include <iostream>
#include <math.h>
#define rows 2
#define columns 10
using namespace std;

int main() {
	setlocale(LC_ALL, "Russian");
	int A[rows][columns];
	bool flag = true;
	for (int i = 0; i < rows; i++) {
		for (int j = 0; j < columns; j++) {
			cout << "A[" << i << "][" << j << "] = "; cin >> A[i][j];
		}
	}
	for (int j = 0; j < columns; j++) {
		if (A[0][j] == 0 && A[1][j] == 0) {
			flag = false;
			cout << "Некорректные данные" << endl;
			break;
		}
		cout << A[0][j] - A[1][j] << endl;
	}
	if (flag) {
		cout << "Рассмотрен весь двумерный массив." << endl;
	}
	system("pause");
	return 0;

}

/*
Тест 1
A[0][0] = 25
A[0][1] = 14
A[0][2] = 8
A[0][3] = 23
A[0][4] = 30
A[0][5] = 13
A[0][6] = 18
A[0][7] = 11
A[0][8] = 12
A[0][9] = 8
A[1][0] = 7
A[1][1] = 13
A[1][2] = 9
A[1][3] = 23
A[1][4] = 3
A[1][5] = 3
A[1][6] = 6
A[1][7] = 2
A[1][8] = 27
A[1][9] = 20
18
1
-1
0
27
10
12
9
-15
-12
Рассмотрен весь двумерный массив.

Тест 2
A[0][0] = 25
A[0][1] = 14
A[0][2] = 8
A[0][3] = 23
A[0][4] = 30
A[0][5] = 13
A[0][6] = 18
A[0][7] = 11
A[0][8] = 12
A[0][9] = 0
A[1][0] = 7
A[1][1] = 13
A[1][2] = 9
A[1][3] = 23
A[1][4] = 3
A[1][5] = 3
A[1][6] = 6
A[1][7] = 2
A[1][8] = 27
A[1][9] = 0
18
1
-1
0
27
10
12
9
-15
Некорректные данные

Тест 3
A[0][0] = 25
A[0][1] = 0
A[0][2] = 8
A[0][3] = 23
A[0][4] = 30
A[0][5] = 13
A[0][6] = 18
A[0][7] = 11
A[0][8] = 12
A[0][9] = 8
A[1][0] = 7
A[1][1] = 0
A[1][2] = 9
A[1][3] = 23
A[1][4] = 3
A[1][5] = 3
A[1][6] = 6
A[1][7] = 2
A[1][8] = 27
A[1][9] = 20
18
Некорректные данные
*/
